<template>
    <div class="service-agreement">
        <h3 class="head">HATC-OMS 运维服务平台软件服务协议</h3>
        <div class="content">
            <span>更新日期：2024年4月25日</span>
            <span>生效日期：2024年4月27日</span>
        </div>
        <div class="paragraph">
            欢迎您使用杭州海康汽车软件有限公司（以下简称“海康汽车”）提供的【HATC-OMS
            运维服务平台管理】产品和服务（以下简称“本服务”）！在您使用本服务或向海康汽车提供任何信息前，请您务必仔细阅读、充分理解各条款内容，
            <span class="bold"
                >特别是涉及您重大权益的条款，包括免除或者限制海康汽车责任的条款、对您的权利进行限制的条款、约定争议解决方式和司法管辖的条款等，以及开通或使用某项服务的单独协议或规则。</span
            >
            前述条款可能以加粗等形式提示您重点注意。<span class="bold"
                >除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本服务。您实施下载、安装、使用、获取账号、登录等任意行为（以下统称为“使用”）均视为您已阅读并同意本协议全部内容。</span
            >
        </div>
        <div class="paragraph">
            <span class="bold"
                >本协议下我们推定您为具备完全民事权利能力和与所从事的民事行为相适应的行为能力的中华人民共和国大陆地区法律实体，且并非任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象（“受限对象”）。</span
            >如果您不符合前述情形，请暂停后续操作，并可按以下方式寻求解决：（1）若您不是中国大陆地区用户，请通过海康汽车于当地设立的网站或软件（如有）等了解各项海康汽车服务使用说明及签署相关协议；（2）如果您因年龄等因素不具备完全民事行为能力，请您及时告知海康汽车并立即停止使用本服务；（3）如果您是受限对象，请在相关限制情形消失或解除后再行发起本平台服务使用申请。<span
                class="bold"
                >若您并非前述适格主体但仍继续签署本协议的，海康汽车有权在获知相关情况后拒绝或终止向您提供服务，您（及您的监护人）须自行承担相关损失。</span
            >
        </div>
        <div class="paragraph">
            <p class="title">一、协议签订</p>
            1、本协议是您和海康汽车之间关于您使用本服务所订立的协议。<span
                class="bold"
                >如您作为最终用户，代表您所在的企业/组织实际使用本服务的，您所在的企业/组织同样受到本协议全部条款的约束。</span
            ><br />
            <span class="bold"
                >2、本协议内容包括本协议正文、<a @click="goPolicy"
                    >《HATC-OMS 运维服务平台隐私政策》</a
                >及海康汽车已经发布或将来可能发布的各项政策、规则、声明、通知、警示、提示、说明（以下简称“规则”）。</span
            >所有规则均为本协议不可分割的组成部分，与本协议正文具有同等法律效力。<br />
            <span class="bold"
                >3、海康汽车根据业务运营需要不时调整或更新本协议及相关规则，并以相关服务页面提示、官网公告、网页提示、电子邮箱、手机短信等方式中的一种或多种通知予您。您可前往查阅最新协议版本。相关调整或更新将自相关公告或通知载明之日起生效（若无特别注明，则为公告或通知7日后生效）。</span
            >若您不接受相关调整或更新，应立即停止使用本服务，如您继续使用本服务，即表示您已接受经修订的协议和规则。
        </div>
        <div class="paragraph">
            <p class="title">二、服务内容</p>
            <span
                >1、HATC-OMS
                运维服务平台为您提供账号登录、密码修改、绑定海康汽车硬件设备、实时预览及回放记录仪视频及图片、记录仪轨迹回放、车辆对讲、文本下发、车辆信息展示、消息推送及展示、聚合地图、查找地点及规划导航路线、电子围栏、司机信息展示、数据报表等功能和服务。</span
            ><br />
            <span
                >2、本服务的端口包括但不限于网站（网址：https://vms.hikvisionauto.com:8444）、安卓手机端、IOS手机端、其他各类移动应用、被集成入第三方产品或软件的部分功能/服务（包括但不限于小程序、公众号等）。不同端口提供的具体功能或服务可能存在差异，具体端口及功能或服务以海康汽车实际提供为准。海康汽车会不断更新本服务，如您已使用一个版本/端口的服务，则可以以同一账号使用其他版本/端口的服务，本协议自动适用于您所使用的本服务所有版本。</span
            ><br />
            <span
                >3、本服务不包括其他第三方通过前述网页、客户端或功能直接向您提供的服务（以下统称“第三方服务”），第三方服务不适用本协议，您应按照您与第三方所签署之协议使用第三方服务并受到其约束。</span
            ><br />
            <span
                >4、为改善用户体验、保障服务运营安全性等目的，您理解并同意，海康汽车可能随时对本服务或本服务任何部分及其相关功能、应用软件进行变更、升级、修改、转移（以下统称为“调整”）。相关调整将以服务新版本、系统更新等形式发布，您应根据提示及时操作，避免因无法继续使用本服务或本服务不稳定等造成不必要的损失。</span
            >
        </div>
        <div class="paragraph">
            <p class="title">三、服务使用规范</p>
            <p class="title2">1、账号管理</p>
            1.1
            本服务不提供自行注册账号的服务，您登录本服务的账号为海康汽车授权的账号。您在获得海康汽车授权的账号后，应尽快修改密码。如果您发现有人未经您的授权使用了您的账号，您需要按照海康汽车提供的修改密码流程进行密码重置。<br />
            <span class="bold"
                >1.2
                您应知晓并理解，如您终止本服务，或您的账号被注销或被收回，海康汽车将自行对账号相关内容及信息以包括但不限于删除等方式进行处理，您应自行承担未及时备份等的损失或责任。</span
            ><br />
            1.3 请您注意，<span class="bold"
                >您及您所在的企业/组织（如有）均应为账号下全部操作行为负责。</span
            >因此，在使用本服务时，请您务必保管好您的账号，并确保您所使用的账号为您自身合法持有且您享有完全的使用控制权。若您代表所在企业/组织从事前述行为，请确保已于事前取得相应的合法授权，有权代表企业/组织管理账号并使该企业/组织受本协议的约束。海康汽车有权要求您提供您及/或您所在的企业/组织的相关主体证明材料及授权文件。如果您未保管好账号和密码而对您、您所在的企业/组织、海康汽车或第三方造成损失的，您应负全部责任。您同意，在任何情况下不向他人透露账号及密码信息，若发现任何非法使用账号或安全漏洞的情况，有义务立即通知海康汽车。<br />
            <span class="bold"
                >1.4
                您知悉并认可，在法律允许的最大范围内，账号的所有权以及您使用账号相关服务数据和记录（包括但不限于所有登录和使用数据等）均归海康汽车所有。发生争议时，您同意以海康汽车的后台系统数据为准。您仅获得账号的使用权，且不得赠与、借用、租用、转让或售卖该账号。</span
            ><br />
            <span class="bold"
                >1.5
                您理解并确认，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用本服务，否则您及/或您的监护人（如涉及）应承担因此而导致的一切后果，且海康汽车有权注销或永久冻结您的账户，给海康汽车造成损失的，海康汽车有权向您追偿。如您代表一家公司或其他法律主体实际使用本服务的，则您声明和保证，您有权使该公司或该法律主体受本协议的约束。</span
            ><br />
            <span class="bold"
                >1.6
                您可以通过本协议中的联系方式联系海康汽车进行账号注销，我们在收到您的账号注销申请后，将在15个工作日内完成核查处理。注销账号后，海康汽车将停止为您提供相应账号项下本服务，并自行对账号相关内容及信息以包括但不限于删除、匿名化处理等方式进行处理，但法律法规等另有规定除外。您应谨慎操作并注意提前备份，否则，应自行承担由此导致的全部损失或责任。</span
            ><br />
            <span class="bold"
                >1.7
                您理解并确认，若您在服务期限届满时不再使用本服务，海康汽车将于【90】日历天后，注销您的账号并删除所有相关数据，您应自行承担未及时备份等的损失或责任。即使有前述约定，海康汽车不对服务期限届满后账号内数据的完整性、真实性等内容做出任何形式的保证。</span
            ><br />
            <p class="title2">2、 用户注意事项</p>
            <span
                >2.1
                您理解并同意：为了向您提供有效的服务，本服务会利用用户终端设备的处理器和带宽等资源。本服务使用过程中可能产生数据流量的费用，您需自行向运营商了解相关资费信息，并自行承担相关费用。</span
            ><br />
            <span class="bold"
                >2.2
                您应确保您使用的海康汽车硬件产品与绑定海康汽车硬件产品的车辆，为您自有或已经获得权利人的使用许可，您使用海康汽车硬件产品与绑定海康汽车硬件产品的车辆不会侵犯任何第三方的合法权益，若您未经许可使用了他人的硬件产品或车辆，由此导致任何纠纷您需自行与第三方处理解决。</span
            ><br />
            <span
                >2.3
                您在使用本服务某一特定服务或功能时，可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），且该特定服务或功能也可能由其他主体提供，您在使用该项服务或功能前请阅读并同意该服务或功能提供者的相关单独协议、业务规则。您使用前述特定服务，即视为您接受相关单独协议、业务规则。</span
            ><br />
            <span class="bold"
                >2.4
                您理解并同意海康汽车将会尽其商业上的合理努力保障您在使用本服务中的数据存储安全，但是海康汽车并不能就此提供完全保证。</span
            ><br />
            <span
                >2.5
                您在使用本服务时，须自行承担如下来自海康汽车不可掌控的风险内容，包括但不限于：</span
            ><br />
            <span
                >（1）由于不可抗拒因素可能引起的用户信息丢失、泄漏等风险；</span
            ><br />
            <span
                >（2）您必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由您自行承担；</span
            ><br />
            <span
                >（3）您在使用本服务访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由您自行承担；</span
            ><br />
            <span
                >（4）您发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；</span
            ><br />
            <span
                >（5）由于网络信号不稳定、网络带宽小等网络原因，所引起的本服务登录失败、资料同步不完整、页面打开速度慢等风险；</span
            ><br />
            <span
                >（6）因用户管理不善造成账号、密码等被复制、被盗用或未经授权使用而带来的风险和责任。</span
            ><br />
        </div>
        <div class="paragraph">
            <p class="title">四、用户行为规范</p>
            <p class="title2">1、软件使用规范</p>
            您在使用本服务时不得实施如下行为：<br />
            1.1
            删除本软件及其他副本上一切关于版权的信息，以及修改、删除或避开本软件为保护知识产权而设置的技术措施；<br />
            1.2
            对本软件进行反向工程，如反汇编、反编译或者其他驶入获得本服务的源代码；<br />
            1.3
            通过修改或伪造软件运行中的指令、数据，增加、删减、变动服务的功能或运行效果，或者将用于上述用途的服务、方法进行运营或向公众传播，无论这些行为是否为商业目的；<br />
            1.4
            使用本软件进行任何危害网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/账户；未经允许进入公众网络或者他人操作系统并删除、修改、增加存储信息；未经许可企图探查、扫描、测试本软件的系统或网络的弱点或其他实施破坏网络安全的行为；企图干涉、破坏本服务系统或网站的正常运营，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据保名称或部分名称；<br />
            1.5
            通过开发、授权或认可的第三方兼容软件、系统登录或使用本服务，或制作、发布、传播上述工具；<br />
            1.6
            其他以任何不合法的方式、为任何不合法的目的、或以任何与本协议许可使用不一致的方式使用本服务。<br />
            <p class="title2">2、信息内容规范</p>
            2.1
            本条所述信息内容是指您使用本服务过程中所制作、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等账户信息，或文字、语音、图片等发送、回复、公告和相关链接页面，以及其他使用本服务及/或其账号所产生的内容。<br />
            2.2
            您理解并同意，海康汽车一直致力于为您提供文明健康、规范有序的网络环境，<span
                class="bold"
                >您不得利用本服务及/或其账号制作、复制、发布、传播如下干扰本服务正常运营，以及侵犯其他用户或第三方合法权益的内容，</span
            >包括但不限于：<br />
            （1）利用本服务上传、发布、传送、传播、储存违反国家法律法规禁止的内容：<br />
            a. 违反宪法确定的基本原则的；<br />
            b. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br />
            c. 损害国家荣誉和利益的；<br />
            d. 煽动民族仇恨、民族歧视，破坏民族团结的；<br />
            e. 破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
            f. 散布谣言，扰乱社会秩序，破坏社会稳定的；<br />
            g. 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；<br />
            h. 侮辱或者诽谤他人，侵害他人合法权益的；<br />
            i. 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br />
            j. 以非法民间组织名义活动的；<br />
            k.
            不符合遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；<br />
            l. 含有法律、行政法规禁止的其他内容的。<br />
            （2）发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；<br />
            （3）涉及他人隐私、个人信息或资料的；<br />
            （4）发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；<br />
            （5）其他违反法律法规、政策及公序良俗、社会公德或干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。<br />
            2.3
            未经海康汽车书面同意，您不得利用本服务进行销售、牟利或其他商业用途。<br />
        </div>
        <div class="paragraph">
            <p class="title">五、服务的中止或终止</p>
            1、鉴于互联网服务的特殊性，<span class="bold"
                >海康汽车有权对服务内容进行变更，也可能会中断、中止或终止全部或者任一部分的服务，若发生前述中止或终止的情形，</span
            >海康汽车将尽可能通过相关服务页面提示、官网公告、网页提示、电子邮箱、手机短信、常规的信件传送、站内信等方式中一种或多种通知您，您应及时查看。<br />
            <span class="bold"
                >2、您了解并同意，海康汽车可能定期或不定期地对提供网络服务的平台设备、设施和软硬件进行维护或检修，如因此类情况而造成收费服务在合理时间内中止，海康汽车无需承担责任。</span
            >就此等中断，海康汽车将尽可能提前在官网、服务相关页面内进行公告，或通过电子邮件、短信息等方式提前通知您。<br />
            <span class="bold"
                >3、如存在下列违约情形之一，海康汽车有权立即对您中止或终止服务，并要求您赔偿损失：<br />
                （1）您违反第三条服务使用规范之规定；<br />
                （2）您违反第四条用户行为规范之规定；<br />
                （3）您违反第九条合规遵从之规定。</span
            >
        </div>
        <div class="paragraph">
            <p class="title">六、责任承担</p>
            <span class="bold"
                >1、在法律允许的最大范围内，本产品或服务均将按"现状"和按"可得到"的状态提供。海康汽车在此明确声明对服务不作任何明示或暗示的保证，</span
            >包括但不限于对服务的可适用性，没有错误或疏漏，持续性，准确性，可靠性，适用于某一特定用途之类的保证、声明或承诺。<br />
            <span class="bold"
                >2、除法律禁止外，在任何情况下海康汽车不对使用本服务或与本服务的任何内容、服务或功能导致的任何特殊、附带、偶然或间接的损害进行赔偿，即使海康汽车已被告知可能发生该等损害，</span
            >包括但不限于商业利润损失、数据或文档丢失产生的损失、人身伤害、隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失或其他损失。<br />
            3、您充分理解并同意，本服务可能会受到多种因素影响，包括但不限于您的原因、网络设备维护、网络连接故障、网络信号未覆盖、网络传输延时或中断、电子终端、通讯或其他系统的故障或误差、电力故障、罢工、劳动争议、暴乱、骚乱、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令、其他不可抗力或第三方的不作为等不可抗力。使用本服务需接入互联网，可能因网络攻击、黑客攻击、病毒感染等原因将导致网站运行异常、信息泄露、数据丢失或其他问题。除法律法规明确规定要求海康汽车承担责任之外，因本款所述原因给您造成的任何损失由您本人自行承担，海康汽车对此不承担责任。<br />
            4、维护网站安全与正常使用是海康汽车与您的共同责任，海康汽车将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您理解和同意，由于技术水平有限和使用环境复杂，海康汽车及/或其关联公司并不能就此提供完全保证。<br />
            5、您理解并同意，海康汽车是按照现有成熟可行的技术水平为您提供服务。海康汽车将尽到商业上的合理努力提高技术水平、确保服务的稳定和安全，但海康汽车不能保证本服务毫无瑕疵。如果采用时下成熟的行业技术水平无法避免相关瑕疵的出现，海康汽车不必承担责任。<br />
            6、您使用本服务时可能需第三方软件或服务支持，可能因第三方原因导致通讯线路故障、技术问题、网络中断、终端故障、系统不稳定或其他突发状况，海康汽车不保证第三方服务之安全性、准确性、有效性及其他不确定的风险。由此若引发的任何争议及损害，海康汽车不承担任何责任。<br />
            <span class="bold"
                >7、海康汽车对您的最大的、全部的责任，和您在本协议下使用本服务或使用第三方服务而造成的任何损坏、伤害、财产损害的任何及所有索赔的唯一救济措施是基于弥补您遭受的实际损失，且对您的赔偿不超过您因使用本服务而对海康汽车支付的所有款项的总额。但本协议中的任何内容均不能限制或排除由于海康汽车或其任一合作伙伴的疏忽或者欺诈而导致的人员伤亡的责任。</span
            ><br />
            <span class="bold"
                >8、您充分理解并同意，您使用本服务进行的任何相关行为所产生的任何义务、责任和后果应由您自行承当，您的任何管理人员、授权人员、雇员或其他代理人的行为，视为您的行为，由此产生的所有义务、责任和后果同样由您自行承担。如果您代表其他主体使用本服务进行网站或应用程序开发，而您未告知其他主体本协议的存在并获得其书面同意的，您对该等主体使用本服务进行的任何相关行为所产生的任何义务、责任和后果承担连带责任。</span
            ><br />
            <span class="bold"
                >9、您理解并同意，如您违反本协议任意约定的，在不排除本协议其他条款同时适用的前提下，海康汽车有权根据情节严重情况采取以下一项或多项处理措施：</span
            ><br />
            <span class="bold"
                >9.1
                要求限期改正、中止或终止您的使用、限制您部分或全部功能、注销或回收账号、采取其他限制措施；</span
            ><br />
            <span class="bold"
                >9.2
                对于您使用本服务时发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议的信息，海康汽车会直接删除；</span
            ><br />
            <span class="bold"
                >9.3
                如您对第三方造成损害的，您应以自己的名义独立承担法律责任，并应确保海康汽车免于因此产生损失或增加费用；</span
            ><br />
            <span class="bold"
                >9.4
                如因您的行为使海康汽车遭受损失，或受到第三方的索赔，或受到行政管理机关的处罚，您应当赔偿海康汽车因此遭受的损失及/或发生的费用，包括但不限于合理的律师费、调查取证费用、诉讼费等。海康汽车有权向政府主管部门、司法机关等有关机构提供必要、合理的系统记录。</span
            ><br />
        </div>
        <div class="paragraph">
            <p class="title">七、用户信息及个人信息保护</p>
            1、保护用户信息是海康汽车的一项基本原则，海康汽车将会采取合理的措施保护用户的信息。除法律法规规定的情形外，未经用户许可海康汽车不会向第三方公开、透露用户企业信息和个人信息。海康汽车采用适当的技术措施如加密，保障用户信息的安全。<br />
            2、海康汽车将运用各种安全技术和程序建立完善的管理制度来保护用户的个人信息，以免遭受未经授权的访问、使用或披露。<br />
            3、您同意，在使用本服务并向海康汽车提供任何个人信息时，或海康汽车为履行本协议以其它方式收集个人信息时，海康汽车可能会为履行本协议下目的并依照海康汽车的<a
                @click="goPolicy"
                >《HATC-OMS 运维服务平台隐私政策》</a
            >使用、处理及保留此类信息。<br />
            <span class="bold"
                >4、您作为组织用户上传和管理最终用户的名称、手机号等个人信息时，请确保您已经事先获得最终用户的明确同意，仅收集为运营及功能实现目的而必需的个人信息，且已充分告知最终用户个人信息收集的目的、方式和范围等。对于海康汽车及其关联公司而言，您提供的行为视为您已获得相关个人信息主体的完全授权。</span
            ><br />
            5、如您为企业用户，您应当建立信息安全保护制度并对最终用户进行信息安全教育，包括但不限于：将管理权限交予适当的人选；合理设定相关人员的管理权限；提醒或要求最终用户注意信息安全和账号安全，防止账号被他人使用而导致的信息泄露等。<br />
            6、海康汽车非常重视对未成年人个人信息的保护。本产品不向未成年人提供服务。未成年人不应创建自己的个人信息主体账号。如果我们发现了本服务收集了未成年人的个人信息，则会设法尽快删除相关信息。<br />
            7、就您使用本服务过程中所产生的及您所收集或被提供的任何个人信息（“个人信息”），您应根据所有可适用法律法规本服务，并依约履行您在本协议下的义务。您承诺：<br />
            （1）遵守不时修订的所有可适用的隐私和数据保护的法律法规，包括适用于个人信息的法律法规，海康汽车有权要求您提供必要信息以证明您已遵守前述法律法规及本协议约定；<br />
            （2）仅就使用本服务之目的使用、处理您的个人信息，除非最终用户另行授权或同意；<br />
            （3）明确、准确地向最终用户描述您所收集的个人信息以及如何使用、向第三方分享这些信息等；<br />
            （4）采取适宜的技术及系统的安全措施，以保护个人信息免遭未经授权访问或使用，并对前述安全措施的有效性进行定期测试；<br />
            （5）确保所有有权访问个人信息的人员都受保密义务的约束；<br />
            （6）出现未经授权的访问或使用个人信息情况时，及时向海康汽车、最终用户和相关数据保护机构汇报；<br />
            （7）协助海康汽车应对最终用户根据可适用法律法规行使其权利的要求。<br />
            8、更多有关个人信息和隐私保护的相关政策，请详见<a @click="goPolicy"
                >《HATC-OMS 运维服务平台隐私政策》</a
            >。<br />
        </div>
        <div class="paragraph">
            <p class="title">八、知识产权</p>
            1、您了解及同意，除非海康汽车另行声明，本协议项下服务包含的所有非用户上传/提供的产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档等）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利均在全球范围内永久归海康汽车或其关联公司所有。<br />
            2、除非取得海康汽车书面授权，您及您所在的企业/组织（如有）不得为任何商业或非商业目的自行或许可任何第三方实施、使用、转让上述知识产权。
        </div>
        <div class="paragraph">
            <p class="title">九、合规遵从</p>
            1、您承诺对本服务的使用、销售、转让、出口或再出口应遵守任何相关的进出口法律法规或经济制裁规定，包括但不限于美国出口管制条例和美国经济制裁政策。<br />
            2、您保证，对于受美国出口管制条例管控的产品，其不会向（i）受美国经济制裁的国家或地区，包括古巴、伊朗、朝鲜、叙利亚和乌克兰克里米亚地区;（ii）被美国商务部列入“实体清单”等黑名单List的机构或个人，或被美国财政部下属外国资产控制办公室列入“特别指定国民及受封锁清单”、“海外逃避制裁者名单”的人士出售或以其他任何方式提供此类产品。<br />
            3、您进一步承诺不将本服务用于大规模杀伤性武器、生化武器的开发或生产，或有关核爆炸或其他危险的核燃料的活动，以及用于支持严重的人权滥用活动，或转售、转让本服务给从事上述活动的机构或个人。<br />
            4、您违反本条规定的，海康汽车有权立即对您终止服务，并有权要求您承担由此造成的海康汽车全部损失。
        </div>
        <div class="paragraph">
            <p class="title">十、第三方软件或技术</p>
            1、本服务可能会使用第三方技术，亦可能会使用第三方软件或技术（包括软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。<br />
            2、本服务如使用了第三方的软件或技术，海康汽车将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包、或通过开源软件页面等形式进行展示，它们可能会以“软件使用许可协议”“授权协议”“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求海康汽车给予协助，您应当自行承担法律责任。<br />
            3、
            如因本服务使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，海康汽车不承担任何责任。海康汽车不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。<br />
        </div>
        <div class="paragraph">
            <p class="title">十一、有效通知</p>
            1、海康汽车可能会以相关服务页面提示、官网公告、网页提示、电子邮箱、手机短信、常规的信件传送、站内信等方式中的一种或多种，向您送达关于本服务使用的各种规则、通知、提示等信息，<span
                class="bold"
                >该等信息一经发送即视为送达，对您及您所在的企业/组织（如有）产生约束力。</span
            >若您不接受的，应立即停止使用相关服务，并以书面通知方式告知海康汽车。<br />
            2、若由于您提供的电子邮箱、手机号码、通讯地址等信息错误或其他不可归咎于海康汽车的原因，导致您未收到相关规则、通知、提示等信息的，您同意仍然视为已经收到相关信息并受其约束，一切后果及责任由您自行承担。<br />
            3、
            若您有本协议项下相关事项需要通知海康汽车的，请按照以下方式与我们联系，即：<br />
            【杭州海康汽车软件有限公司】<br />
            电子邮箱：hikauto@hikvision.com<br />
            联系电话：【0571-88075998】<br />
            一般情况下，我们将在收到您相关信息并核实您身份后十五日内回复。<br />
        </div>
        <div class="paragraph">
            <p class="title">十二、争议解决及其他</p>
            <span class="bold"
                >1、本协议的订立、效力、解释、履行和争议的解决均适用中华人民共和国的法律法规，并且排除一切冲突法规定的适用。</span
            ><br />
            2、本协议于杭州市滨江区签署生效。<span class="bold"
                >如出现纠纷，您同意将纠纷交由本协议签署地有管辖权的人民法院诉讼解决。</span
            ><br />
            3、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效且具有约束力。<br />
            4、本协议中的标题仅为方便而设，不作为解释本协议的依据。
        </div>
    </div>
</template>
<script>
export default {
    methods: {
        async goPolicy() {
            let url = "/#/privacyPolicy";
            let params = { parameterName: "privacy" };
            let res = await this.$api.getSysInfoValue(params);
            if (res.success == true && res.data) {
                url = res.data.value;
            }
            window.open(url);
            // window.open("/#/privacyPolicy");
        },
    },
};
</script>
<style lang="less" scoped>
.service-agreement {
    color: rgba(0, 0, 0, 0.85);
    line-height: 32px;
    font-size: 16px;
    padding: 66px 200px;
    font-family: PingFangSC-Regular !important;
    .head {
        font-size: 30px;
        font-weight: 500;
    }
    .content {
        text-align: left;
        margin: 18px 0 0 0;
        display: flex;
        flex-direction: column;
    }
    .paragraph {
        text-align: left;
        margin-top: 30px;
        .bold {
            font-weight: bold;
        }
        .title {
            //font-weight: bold;
            font-size: 20px;
            line-height: 36px;
        }
        .title2 {
            font-size: 16px;
            // font-weight: bold;
        }
    }
}
</style>
