import store from "../store";
const gps = store.state.app.wordObj.gps;
const vehiclePositioningMonitoring = [
    {
        title: "车辆状态图例",
        img: "",
        children: [
            {
                title: "运行",
                img: "/static/images/car_empty.png",
                text: "车辆正在行驶中，速度大于0",
            },
            {
                title: "停车",
                img: "/static/images/car_dormancy.png",
                text: "车辆停止行驶，包含两种情况，ACC关或ACC开但是速度等于0",
            },
            {
                title: "离线",
                img: "/static/images/car_offline.png",
                text: "车辆停止运行，且设备无供电，此时无法对设备进行任何操作",
            },
        ],
    },
    {
        title: "预览状态",
        img: "",
        text: "视频终端显示图标，定位终端不显示图标，点击图标可直接预览",
        children: [
            {
                title: "可以预览",
                img: "/static/images/video_can.png",
                text: "车辆ACC开，此时可直接点击图标进行预览",
            },
            {
                title: "可能可以预览",
                img: "/static/images/video_pro.png",
                text: "车辆ACC关，点击后如果设备可以预览，则直接进行预览，若设备需要唤醒后才能预览，则会下发唤醒指令到设备，用户可稍候再次点击看是否已经唤醒",
            },
            {
                title: "无法预览",
                img: "/static/images/video_none.png",
                text: "车辆设备无供电，此时无法对设备进行预览",
            },
        ],
    },
    {
        title: "详情弹窗文字释义",
        img: "",
        children: [
            {
                title: "冻结",
                text: "冻结车辆平台接入。冻结后设备会离线，无法接入平台；解除冻结后，车辆可以正常接入平台使用。冻结不影响车辆授权数。",
            },
            {
                title: "停用",
                text: "停止车辆接入平台正常使用。解除停用需联系购买车辆授权或将不需要监控的车辆移至可停用状态才能正常使用平台。",
            },
            {
                title: "营运状态-过户",
                text: "将营运证过户给他人",
            },
            {
                title: "营运状态-报废",
                text: "运营车辆达到报废标准后强制报废",
            },
            {
                title: "营运状态-停运",
                text: "车辆停止运营，不能上路行驶，在停运期继续行驶将面临处罚",
            },
        ],
    },
    {
        title: "新设备",
        text: "new，车辆已经与设备绑定，但是从未上线过",
    },
    {
        title: "在线数量",
        text: "运行状态和停车状态的车辆总和，即非离线车辆的总和，鼠标放上去可查看在线率",
    },
];
const unhandleAlarm = [
    {
        title: "高危车辆",
        img: "/static/images/dangerous.png",
        imgSize: "18px",
        text: "开启高危提醒，且单车报警发生次数满足X分钟发生X次报警的条件，该车辆视为高危车辆。高危提醒可在报警规则>基础报警规则>弹窗提醒配置",
    },
    {
        title: "上班状态",
        img: "",
        text: "后台记录监控员在线和离线时间，且在线时页面会自动按照刷新周期刷新，离线时页面不再自动刷新；",
    },
    {
        title: "列表顺序",
        text: " 默认按照时间排序，当用户勾选报警等级或风险等级时，列表会优先自动按照报警等级（一级、二级、三级）和风险等级（严重、较重、一般）排序，风险等级可在报警规则->基础报警规则配置",
    },
    {
        title: "刷新周期",
        text: "平台默认每60S刷新一次列表数据，用户可切换选择30S刷新一次或关闭刷新",
    },
    {
        title: "列表数据范围",
        text: "列表默认查询有效时间内配置了需要人工处理且未处理的报警，有效时间可在报警规则->报警处理配置中统一配置，或在监控组管理页面给每一个监控员配置处理时间",
    },
];
const download = [
    {
        title: "设备上传失败",
        img: "",
        imgSize: "",
        text: "设备上传时间超过一个小时且结束时间为空",
    },
];
const fenceSet = [
    {
        title: "禁止驶入",
        text: "车辆驶入区域时，产生禁止驶入报警",
    },
    {
        title: "禁止驶出",
        text: "车辆驶出区域时，产生禁止驶出报警",
    },
    {
        title: "禁止停车",
        text: "车辆在区域内/区域外停车超时，产生禁止停车报警（不允许停车）",
    },
    {
        title: "禁止开门",
        text: "车辆在区域内/区域外触发开门事件时，产生禁止开门报警",
    },
    {
        title: "禁止超速",
        text: "车辆在区域内速度持续超过速度上限值并达到持续时长，产生超速报警/预警",
    },
    {
        title: "禁止偏离路线",
        text: "车辆偏离既定路线行驶时，产生禁止偏离报警。当前仅支持固定路线运输场景，非固定路线运输任务偏离监控Q4支持，敬请期待！",
    },
    {
        title: "禁行路段",
        text: "车辆驶入禁行路段时，产生驶入禁行路段报警。备注：不参与路线围栏组合规则",
    },
    {
        title: "禁止驶入危险区域",
        text: "车辆驶入危险区域时，产生禁止驶入危险区域报警。备注：不参与区域围栏组合规则",
    },
    {
        title: "禁止驶入危险路段",
        text: "车辆驶入危险路段时，产生禁止驶入危险路段报警。备注：不参与路线围栏组合规则",
    },
    {
        title: "凌晨禁行报警",
        text: "凌晨时两客一危车辆在指定区域内启动且车速大于10km/h，产生凌晨禁行报警。备注：不参与区域围栏组合规则",
    },
    {
        title: "违规卸料",
        text: "车辆在区域外触发卸货事件时，产生违规卸货报警。当前仅支持商砼车区域外卸货监控（结合正反转）",
    },
];

const historyPlayback = [
    // {
    //     title: "行驶里程",
    //     text: "检索时间范围内，所统计车辆行驶的累计里程数"
    // },
    // {
    //     title: "在线时长",
    //     text: "检索时间范围内，车辆最后一个定位点时间与第一个定位点时间差（在线时长=运行时长+停车时长"
    // },
    // {
    //     title: "运行时长",
    //     text: "检索时间范围内，车辆速度大于0的定位点累计时长"
    // },
    // {
    //     title: "停车时长",
    //     text: "检索时间范围内，车辆速度等于0的定位点累计时长"
    // },
    {
        title: "无效定位",
        text: `设备上传上来未定位状态的${gps}数据`,
    },
    {
        title: "补报定位",
        text: "设备上传定位数据的定位时间存在时间倒退数据",
    },
    // {
    //     title: "最高速度",
    //     text: "检索时间范围内，车辆所有定位点内行驶速度最高的值"
    // },
    // {
    //     title: "平均速度",
    //     text: "行驶里程/在线时长"
    // },
];
const firmware = [
    {
        title: "是否分享给子账号",
        text: "在上传固件包时，如果是项目管理员，拥有是否分享给子账号的权限，选择是，子账号能看到管理员添加的此固件包，并可使用此固件包进行升级。",
    },
    {
        title: "差分升级",
        text: "对主机进行固件升级时，若设备支持差分升级并且设备使用的版本和目标版本的全量包都存在，平台会根据策略自动生成差分包，并使用差分包对设备进行升级操作，可提升升级成功率，节省升级耗时，降低流量消耗，差分固件包超过3个月平台自动删除，不占用5GB固件存储包存储空间。",
    },
];
export default {
    vehiclePositioningMonitoring,
    unhandleAlarm,
    historyPlayback,
    download,
    fenceSet,
    firmware,
};
